In [2]:
import pandas as pd
from glob import glob
import numpy as np

## Build a Datframe from a multiple files (row wise)

In [2]:
df=pd.read_csv("C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_January_2019.csv")

In [3]:
sale_file = sorted(glob("C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_*.csv"))

In [4]:
sale_file

['C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_April_2019.csv',
 'C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_August_2019.csv',
 'C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_December_2019.csv',
 'C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_February_2019.csv',
 'C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_January_2019.csv',
 'C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_July_2019.csv',
 'C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_June_2019.csv',
 'C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_March_2019.csv',
 'C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_May_2019.csv',
 'C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_November_2019.csv',
 'C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_October_2019.csv',
 'C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_September_2019.csv']

In [5]:
pd.concat(pd.read_csv(file) for file in sale_file)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
...,...,...,...,...,...,...
11681,259353,AAA Batteries (4-pack),3,2.99,09/17/19 20:56,"840 Highland St, Los Angeles, CA 90001"
11682,259354,iPhone,1,700,09/01/19 16:00,"216 Dogwood St, San Francisco, CA 94016"
11683,259355,iPhone,1,700,09/23/19 07:39,"220 12th St, San Francisco, CA 94016"
11684,259356,34in Ultrawide Monitor,1,379.99,09/19/19 17:30,"511 Forest St, San Francisco, CA 94016"
11685,259357,USB-C Charging Cable,1,11.95,09/30/19 00:18,"250 Meadow St, San Francisco, CA 94016"

In [6]:
pd.concat((pd.read_csv(file) for file in sale_file), ignore_index=True)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
...,...,...,...,...,...,...
186845,259353,AAA Batteries (4-pack),3,2.99,09/17/19 20:56,"840 Highland St, Los Angeles, CA 90001"
186846,259354,iPhone,1,700,09/01/19 16:00,"216 Dogwood St, San Francisco, CA 94016"
186847,259355,iPhone,1,700,09/23/19 07:39,"220 12th St, San Francisco, CA 94016"
186848,259356,34in Ultrawide Monitor,1,379.99,09/19/19 17:30,"511 Forest St, San Francisco, CA 94016"
186849,259357,USB-C Charging Cable,1,11.95,09/30/19 00:18,"250 Meadow St, San Francisco, CA 94016"

## Build a Datframe from a multiple files (columns wise)

In [67]:
#pd.concat((pd.read_csv(file) for file in sales_file),axis ='columns')

In [68]:
#pd.concat((pd.read_csv(file) for file in sales_file),axis =1)

## show install version

In [7]:
pd.__version__

'0.25.3'

In [9]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : None
python           : 3.7.1.final.0
python-bits      : 32
OS               : Windows
OS-release       : 10
machine          : x86
processor        : x86 Family 6 Model 42 Stepping 7, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : None.None

pandas           : 0.25.3
numpy            : 1.17.3
pytz             : 2019.3
dateutil         : 2.8.1
pip              : 19.3.1
setuptools       : 41.6.0.post20191030
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : 4.4.2
html5lib         : 1.0.1
pymysql          : None
psycopg2         : None
jinja2           : 2.10.3
IPython          : 7.9.0
pandas_datareader: 0.8.1
bs4              : 4.8.1
bottleneck       : None
fastparquet      : None
gcsfs            : None
lxml.etree       : 4.4.2
matplotlib       : 2.2.3
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : None
pytables         : None
s3fs             : None
scipy            : 1.3.2
sqlalchemy       : None
tables           : None
xarray           : None
xlrd             : 1.2.0
xlwt             : None
xlsxwriter       : None

## Create an example dataframe

In [10]:
df = pd.DataFrame({'col one':[100,200], 'col two':[300,400]})
df

   col one  col two
0      100      300
1      200      400

In [13]:
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.583083,0.558498,0.041170,0.631226,0.561588,0.072044,0.698179,0.126715
1,0.871241,0.520025,0.078890,0.960231,0.853644,0.462094,0.733930,0.036835
2,0.893393,0.133441,0.071778,0.590549,0.585630,0.017112,0.004752,0.125356
3,0.050174,0.617179,0.916210,0.844263,0.413856,0.534280,0.703091,0.908694

In [15]:
pd.DataFrame(np.random.rand(4,8), columns=list('abcdefgh'))

,a,b,c,d,e,f,g,h
0,0.681615,0.501345,0.912008,0.764144,0.224501,0.657770,0.268161,0.250165
1,0.159948,0.605026,0.304955,0.115570,0.057965,0.512432,0.307542,0.043894
2,0.954140,0.387554,0.255691,0.982996,0.307849,0.143325,0.372676,0.607693
3,0.311405,0.654119,0.415657,0.538941,0.468777,0.166486,0.805399,0.187009

## Rename columns

In [16]:
df

   col one  col two
0      100      300
1      200      400

In [17]:
df =df.rename({'col one':'col_one','col two':'col_two'},axis=1)

In [18]:
df.columns=['col_one','col_two']

In [19]:
df.columns = df.columns.str.replace(' ','_')

In [20]:
df

   col_one  col_two
0      100      300
1      200      400

In [22]:
df.add_prefix('X_')

   X_col_one  X_col_two
0        100        300
1        200        400

In [25]:
df.add_suffix('_Y')

   col_one_Y  col_two_Y
0        100        300
1        200        400

## Reverse row order

In [115]:
df=pd.read_csv("C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_January_2019.csv")

In [27]:
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"

In [29]:
df.loc[::-1].head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
9722,150501,Google Phone,1,600,01/13/19 16:43,"428 Cedar St, Boston, MA 02215"
9721,150500,AAA Batteries (4-pack),2,2.99,01/15/19 14:21,"810 2nd St, Los Angeles, CA 90001"
9720,150499,ThinkPad Laptop,1,999.99,01/21/19 14:31,"214 Main St, Portland, OR 97035"
9719,150498,27in FHD Monitor,1,149.99,01/10/19 22:58,"403 7th St, San Francisco, CA 94016"
9718,150497,20in Monitor,1,109.99,01/26/19 19:09,"95 8th St, Dallas, TX 75001"

In [32]:
df.loc[::-1].reset_index(drop=True).head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,150501,Google Phone,1,600,01/13/19 16:43,"428 Cedar St, Boston, MA 02215"
1,150500,AAA Batteries (4-pack),2,2.99,01/15/19 14:21,"810 2nd St, Los Angeles, CA 90001"
2,150499,ThinkPad Laptop,1,999.99,01/21/19 14:31,"214 Main St, Portland, OR 97035"
3,150498,27in FHD Monitor,1,149.99,01/10/19 22:58,"403 7th St, San Francisco, CA 94016"
4,150497,20in Monitor,1,109.99,01/26/19 19:09,"95 8th St, Dallas, TX 75001"

## Reverse columns order

In [33]:
df.loc[:,::-1].head()

,Purchase Address,Order Date,Price Each,Quantity Ordered,Product,Order ID
0,"944 Walnut St, Boston, MA 02215",01/22/19 21:25,700,1,iPhone,141234
1,"185 Maple St, Portland, OR 97035",01/28/19 14:15,14.95,1,Lightning Charging Cable,141235
2,"538 Adams St, San Francisco, CA 94016",01/17/19 13:33,11.99,2,Wired Headphones,141236
3,"738 10th St, Los Angeles, CA 90001",01/05/19 20:33,149.99,1,27in FHD Monitor,141237
4,"387 10th St, Austin, TX 73301",01/25/19 11:59,11.99,1,Wired Headphones,141238

## Select columns by data type

In [35]:
df.dtypes

Order ID            object
Product             object
Quantity Ordered    object
Price Each          object
Order Date          object
Purchase Address    object
dtype: object

In [37]:
df.select_dtypes(include='number').head()

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [38]:
df.select_dtypes(include='object').head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"

In [40]:
df.select_dtypes(include=['object','number','category','datetime']).head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"

In [41]:
df.select_dtypes(exclude='object').head()

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

## convert strings into number

In [45]:
df = pd.DataFrame({'col_1':['1.1','2.2','3.3'],
                   'col_2':['4.4','5.5','6.6'],
                   'col_3':['7.7','8.8','-']})
df

  col_1 col_2 col_3
0   1.1   4.4   7.7
1   2.2   5.5   8.8
2   3.3   6.6     -

In [46]:
df.dtypes

col_1    object
col_2    object
col_3    object
dtype: object

In [47]:
df.astype({'col_1':'float','col_2':'float'}).dtypes

col_1    float64
col_2    float64
col_3     object
dtype: object

In [49]:
pd.to_numeric(df['col_3'])

ValueError: Unable to parse string "-" at position 2

In [51]:
pd.to_numeric(df['col_3'], errors='coerce')

0    7.7
1    8.8
2    NaN
Name: col_3, dtype: float64

In [52]:
pd.to_numeric(df['col_3'], errors='coerce').fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_3, dtype: float64

In [56]:
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df

   col_1  col_2  col_3
0    1.1    4.4    7.7
1    2.2    5.5    8.8
2    3.3    6.6    0.0

In [57]:
df.dtypes

col_1    float64
col_2    float64
col_3    float64
dtype: object

## reduce data frame size

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9723 entries, 0 to 9722
Data columns (total 6 columns):
Order ID            9697 non-null object
Product             9697 non-null object
Quantity Ordered    9697 non-null object
Price Each          9697 non-null object
Order Date          9697 non-null object
Purchase Address    9697 non-null object
dtypes: object(6)
memory usage: 227.9+ KB

In [61]:
cols = ['Product','Price Each']
df1=pd.read_csv('C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_January_2019.csv', usecols=cols)

In [63]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9723 entries, 0 to 9722
Data columns (total 2 columns):
Product       9697 non-null object
Price Each    9697 non-null object
dtypes: object(2)
memory usage: 76.0+ KB

In [66]:
dtypes={'Product':'category'}
cols = ['Product','Price Each']
df1=pd.read_csv('C:\\Users\\Ashish\\Desktop\\New folder (2)\\Pandas-Data-Science-Tasks-master\\SalesAnalysis\\Sales_Data\\Sales_January_2019.csv', usecols=cols,dtype=dtypes)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9723 entries, 0 to 9722
Data columns (total 2 columns):
Product       9697 non-null category
Price Each    9697 non-null object
dtypes: category(1), object(1)
memory usage: 48.0+ KB

## split a dataframe into two random subset

In [72]:
len(df)

9723

In [73]:
df_new1= df.sample(frac=0.75)

In [74]:
df_new2= df.drop(df_new1.index)

In [75]:
len(df_new1)+len(df_new2)

9723

In [76]:
df_new1.index.sort_values()

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            9710, 9711, 9712, 9713, 9714, 9715, 9717, 9718, 9719, 9720],
           dtype='int64', length=7292)

In [77]:
df_new2.index.sort_values()

Int64Index([  11,   24,   28,   31,   34,   35,   39,   40,   41,   50,
            ...
            9665, 9669, 9674, 9693, 9695, 9700, 9705, 9716, 9721, 9722],
           dtype='int64', length=2431)

In [81]:
df_new1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7292 entries, 8036 to 4668
Data columns (total 6 columns):
Order ID            7272 non-null object
Product             7272 non-null object
Quantity Ordered    7272 non-null object
Price Each          7272 non-null object
Order Date          7272 non-null object
Purchase Address    7272 non-null object
dtypes: object(6)
memory usage: 227.9+ KB

In [80]:
df_new2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2431 entries, 11 to 9722
Data columns (total 6 columns):
Order ID            2425 non-null object
Product             2425 non-null object
Quantity Ordered    2425 non-null object
Price Each          2425 non-null object
Order Date          2425 non-null object
Purchase Address    2425 non-null object
dtypes: object(6)
memory usage: 76.0+ KB

## filter a dataframe by multiple categories

In [82]:
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"

In [84]:
df.Product.unique()

array(['iPhone', 'Lightning Charging Cable', 'Wired Headphones',
       '27in FHD Monitor', 'AAA Batteries (4-pack)',
       '27in 4K Gaming Monitor', 'USB-C Charging Cable',
       'Bose SoundSport Headphones', 'Apple Airpods Headphones',
       'Macbook Pro Laptop', 'Flatscreen TV', 'Vareebadd Phone',
       'AA Batteries (4-pack)', 'Google Phone', '20in Monitor',
       '34in Ultrawide Monitor', 'ThinkPad Laptop', 'LG Dryer',
       'LG Washing Machine', nan, 'Product'], dtype=object)

In [86]:
df[(df['Product']=='iPhone')| (df['Product']=='LG Dryer')].head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
104,141336,iPhone,1,700,01/09/19 18:23,"811 Hickory St, Portland, OR 97035"
109,141341,LG Dryer,1,600.0,01/13/19 10:09,"844 Walnut St, Austin, TX 73301"
164,141394,iPhone,1,700,01/06/19 16:54,"534 12th St, San Francisco, CA 94016"
207,141437,iPhone,1,700,01/10/19 15:40,"377 Meadow St, New York City, NY 10001"

In [88]:
df[df["Product"].isin(['iPhone','LG Dryer'])].head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
104,141336,iPhone,1,700,01/09/19 18:23,"811 Hickory St, Portland, OR 97035"
109,141341,LG Dryer,1,600.0,01/13/19 10:09,"844 Walnut St, Austin, TX 73301"
164,141394,iPhone,1,700,01/06/19 16:54,"534 12th St, San Francisco, CA 94016"
207,141437,iPhone,1,700,01/10/19 15:40,"377 Meadow St, New York City, NY 10001"

In [89]:
df[~df["Product"].isin(['iPhone','LG Dryer'])].head() ## ~ its means they iphone and lg dryer never include

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"
5,141239,AAA Batteries (4-pack),1,2.99,01/29/19 20:22,"775 Willow St, San Francisco, CA 94016"

## Filter a dataframe by largest categories

In [90]:
counts = df.Product.value_counts()
counts

USB-C Charging Cable          1171
AAA Batteries (4-pack)        1082
Lightning Charging Cable      1068
AA Batteries (4-pack)         1039
Wired Headphones              1005
Apple Airpods Headphones       809
Bose SoundSport Headphones     656
27in FHD Monitor               418
iPhone                         379
Google Phone                   317
34in Ultrawide Monitor         313
27in 4K Gaming Monitor         312
Flatscreen TV                  243
Macbook Pro Laptop             235
ThinkPad Laptop                216
20in Monitor                   213
Vareebadd Phone                124
LG Washing Machine              42
LG Dryer                        39
Product                         16
Name: Product, dtype: int64

In [91]:
counts.nlargest(3)

USB-C Charging Cable        1171
AAA Batteries (4-pack)      1082
Lightning Charging Cable    1068
Name: Product, dtype: int64

In [92]:
counts.nlargest(3).index

Index(['USB-C Charging Cable', 'AAA Batteries (4-pack)',
       'Lightning Charging Cable'],
      dtype='object')

In [93]:
df[df['Product'].isin(counts.nlargest(3).index)].head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
5,141239,AAA Batteries (4-pack),1,2.99,01/29/19 20:22,"775 Willow St, San Francisco, CA 94016"
7,141241,USB-C Charging Cable,1,11.95,01/05/19 12:04,"181 6th St, San Francisco, CA 94016"
12,141246,AAA Batteries (4-pack),3,2.99,01/09/19 18:57,"618 7th St, Los Angeles, CA 90001"
18,141252,USB-C Charging Cable,1,11.95,01/30/19 09:28,"220 9th St, Los Angeles, CA 90001"

## Handling Missing vale

In [94]:
df.isnull().sum()

Order ID            26
Product             26
Quantity Ordered    26
Price Each          26
Order Date          26
Purchase Address    26
dtype: int64

In [95]:
df.isnull().mean()

Order ID            0.002674
Product             0.002674
Quantity Ordered    0.002674
Price Each          0.002674
Order Date          0.002674
Purchase Address    0.002674
dtype: float64

In [96]:
df.dropna(thresh=len(df)*.9,axis=1).head()## more than 10% nan occur any columns then they drop it
## 0.9 means atleast 90% values is not missing,,,, keep the columns

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"

## Split a string into multiple columns

In [97]:
df = pd.DataFrame({'name':['John Arthur Doe', 'Jane Ann Smith'],
                   'location':['Los Angeles, CA', 'Washington, DC']})
df

              name         location
0  John Arthur Doe  Los Angeles, CA
1   Jane Ann Smith   Washington, DC

In [98]:
df.name.str.split(' ',expand=True)

      0       1      2
0  John  Arthur    Doe
1  Jane     Ann  Smith

In [100]:
df[['First','Middle','Last']] = df.name.str.split(' ',expand=True)
df

              name         location First  Middle   Last
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith

In [103]:
df.location.str.split(',',expand=True)

             0    1
0  Los Angeles   CA
1   Washington   DC

In [106]:
df['city']=df.location.str.split(',',expand=True)[0]
df

              name         location First  Middle   Last         city
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe  Los Angeles
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith   Washington

## Expand a series of lists into Dataframe

In [110]:
df = pd.DataFrame({'col_one':['a', 'b', 'c'], 'col_two':[[10, 40], [20, 50], [30, 60]]})
df

  col_one   col_two
0       a  [10, 40]
1       b  [20, 50]
2       c  [30, 60]

In [112]:
df_new =df.col_two.apply(pd.Series)
df_new

    0   1
0  10  40
1  20  50
2  30  60

In [114]:
pd.concat([df,df_new],axis=1)

  col_one   col_two   0   1
0       a  [10, 40]  10  40
1       b  [20, 50]  20  50
2       c  [30, 60]  30  60

## select a slice of row and columns

In [116]:
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"

In [117]:
df.describe()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
count,9697,9697,9697,9697,9697,9697
unique,9269,20,8,19,8077,9161
top,Order ID,USB-C Charging Cable,1,11.95,Order Date,Purchase Address
freq,16,1171,8795,1171,16,16

In [118]:
df.describe().loc['unique':'freq']

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
unique,9269,20,8,19,8077,9161
top,Order ID,USB-C Charging Cable,1,11.95,Order Date,Purchase Address
freq,16,1171,8795,1171,16,16

In [119]:
df.describe().loc['unique':'freq','Product':'Order Date']

                     Product Quantity Ordered Price Each  Order Date
unique                    20                8         19        8077
top     USB-C Charging Cable                1      11.95  Order Date
freq                    1171             8795       1171          16

## convert continuous data into categorical data

In [4]:
titanic =pd.read_csv('C:\\Users\\Ashish\\train.csv')

In [123]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [124]:
titanic.Age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [127]:
titanic['Person']=pd.cut(titanic['Age'], bins=[0,18,30,99], labels=['Child','Young adult','Adult'])
titanic.head()## in bins -0 to 18=child,18 to 30=young adult,30 to 99= adult

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Person
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Young adult
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adult
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Young adult
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adult
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Adult

## Change Display option

In [128]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Person
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Young adult
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adult
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Young adult
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adult
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Adult

In [129]:
pd.set_option('display.float_format', '{:.2f}'.format)

In [130]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Person
0,1,0,3,"Braund, Mr. Owen Harris",male,22.00,1,0,A/5 21171,7.25,NaN,S,Young adult
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,0,PC 17599,71.28,C85,C,Adult
2,3,1,3,"Heikkinen, Miss. Laina",female,26.00,0,0,STON/O2. 3101282,7.92,NaN,S,Young adult
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,0,113803,53.10,C123,S,Adult
4,5,0,3,"Allen, Mr. William Henry",male,35.00,0,0,373450,8.05,NaN,S,Adult

In [5]:
titanic.Sex

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [7]:
titanic[['Sex']]

        Sex
0      male
1    female
2    female
3    female
4      male
..      ...
886    male
887  female
888  female
889    male
890    male

[891 rows x 1 columns]

In [1]:
data_new=pd.read_csv('DataFraud.csv')

NameError: name 'pd' is not defined

'import' is not recognized as an internal or external command,
operable program or batch file.